# BuiltInFailures.SheetFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SheetFailures Class
BuiltInFailures Class Members See Also
---
Failures about Sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SheetFailures
```

Visual Basic
---
```text
Public NotInheritable Class SheetFailures
```

Visual C++
---
```text
public ref class SheetFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SheetFailures
# See Also
BuiltInFailures..::..SheetFailures Members
Autodesk.Revit.DB Namespace